### Dir: aws/personal/project_a/
#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```


Initializing the backend...

Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v4.57.0...
- Installed hashicorp/aws v4.57.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.


```

</details>

#### Terraform Apply 📖`success`
<details><summary>Show Apply</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ebs_volume.example[0] will be created
  + resource "aws_ebs_volume" "example" {
      + arn               = (known after apply)
      + availability_zone = "us-east-1a"
      + encrypted         = (known after apply)
      + final_snapshot    = false
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 8
      + snapshot_id       = (known after apply)
      + tags              = {
          + "Name" = "HelloWorld 01"
        }
      + tags_all          = {
          + "Name" = "HelloWorld 01"
        }
      + throughput        = (known after apply)
      + type              = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_ebs_volume.example[0]: Creating...
aws_ebs_volume.example[0]: Still creating... [10s elapsed]
aws_ebs_volume.example[0]: Creation complete after 11s [id=vol-02b1029e01aa16551]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```

</details>

*Pusher: @kaveh-deriv, Action: `pull_request_review`, Workflow: `Terraform Apply`*